{"id":0,"name":"BTWIN-1","price":"899","tabImages":["..\/images\/bike_1\/image1","..\/images\/bike_1\/image2","..\/images\/bike_1\/image3","..\/images\/bike_1\/image5","..\/images\/bike_1\/image6","..\/images\/bike_1\/image7","..\/images\/bike_1\/image8"],"shortDescription":"You ride regularly and want to benefit from assisted pedalling. The Tilt 500 E folds 3 times so that you can go further.<br><br>Are you looking for an electric bike that's easy to take with you? The TILT 500 E fits in your car boot and is perfect for weekday commutes and weekend rides of up to 35 km.<\/br><\/br>","stock":11,"advantages":"<strong>Easy transport<\/strong><br>\n\n    Ride, fold, carry, store: 15s is all you need. You can't ride it when folded.<br><br>\n    <strong>Versatility<\/strong><br>\n\n    Enjoy limitless adventures with electric assistance and 6 speeds!<br><br>\n    <strong>Compact design<\/strong><br>\n\n    Folded L\/H\/W: 83 x 67 x 45 cm.Unfolded L\/H\/W: 155 x 114 x 60 cm<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Ergonomic grips and saddle, height-adjustable stem\n    <strong>Lifetime warranty <\/strong>\n\n    <br><br>B'Twin offers a lifetime warranty on the frame (excl. hinge), stem and handlebar","technicalInfos":"<strong>Motor \/ battery <\/strong><br>\n    Battery range: 35 km in economy mode\/25 km in normal mode\/20 km in sport mode (indicative information that may vary depending on the tyre pressure, the terrain, the conditions, and the weight of the rider).<br>\n    Battery: lifespan of 350 to 500 charge cycles.<br><br> <strong>Warranty:<\/strong> 2 years.250W brushless motor, 24V battery built into frame, 7.8 Ah electric assistance controlled by pedalling sensors.<br>\n\n    Motor torque: 26<br>\n    Battery and charger supplied with the bike\n    Frame<br>\n    Aluminium frame with built-in battery. The battery can be charged directly through the frame, or can be removed from its housing to be recharged at home or at work.Frame compatible with the B'Twin TILT 20-inch pannier rack.<br><br>\n    <strong>Fork<\/strong><br>\n    \n    Steel fork.\n    Drivetrain\n    6 speeds with Shimano grip shifter. Shimano Tourney 6-speed rear derailleur. 52-teeth chainring.<br><br>\n    <strong>Brakes<\/strong><br>\n    Aluminium V-Brake callipers for powerful, progressive braking.\n    Aluminium levers with rubber pads for added comfort. Braking cuts out electric assistance.\n    <br><br><strong>Remember:<\/strong><br> The brake pads on electrically-assisted bikes wear down more quickly than a classic bike due to the weight and power of the motor.<br>\n    Handlebar \/ stem \/ steering\n    Fold-down, height-adjustable aluminium stem for added comfort.\n    Quick release with automatic safety lever\n    Semi-raised aluminium handlebar.\n    Saddle \/ Seat post\n    Anti-theft, anti-rotation aluminium seat post 34mm in diameter.<br><br>\n    <strong>Tyres \/ wheels<\/strong><br>\n    Tyres with anti-puncture reinforcement.\n    Size 20 x 1.75.<br>\n    We've developed these tyres using Skinwall technology for lower weight and higher performance.\n    Double-walled rims for greater rigidity.<br>\n    Motor built into the rear wheel for improved steering control.<br><br>\n    <strong>Accessories\/Equipment<\/strong><br>\n    Battery-powered front and rear lights with handlebar control.This bike is compatible with the TILT transport cover and the B'TWIN pannier rack for foldable bikes.\n    The Tilt 500 E is not compatible with a child seat or a trailer.\n    Care tips<br>\n    Tyres lose pressure over time. On average, they lose 1 bar\/week.\n    So remember to regularly pump up your tyres. Riding with under-inflated tyres reduces your battery range, requires more pedalling effort, and increases the risk of punctures.\n    Before performing any work on your electric bike (cleaning, electrical or mechanical maintenance), you must turn off your electric bike and remove the battery.<br>\n    If you are not using your bike over the winter, charge it at least every 12 months.\n    User size and weight\n    The geometry of this bike offers optimal comfort for cyclists measuring between 1.45m and 1.85m.\n    This bike meets the requirements of the ISO 4210 standard for a cyclist weighing 100kg.<br><br>\n    <strong>Warranty<\/strong><br>\n    Lifetime warranty on the frame, stem (excl. hinge), rigid fork and handlebar.<br><br>\n    <strong>Weight<\/strong><br>\n    18.6 kg","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Recharge the battery after each use. If it is flat, charge it as soon as possible. Irreparable damage may occur if the battery remains flat for too long.<br><br>\n    <strong>User Directions<\/strong><br>\n    Not suitable for tricks.Meets standard for a 100kg cyclist<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":1,"name":"BTWIN-2","price":"500","tabImages":["..\/images\/bike_2\/image1","..\/images\/bike_2\/image2","..\/images\/bike_2\/image3","..\/images\/bike_2\/image4","..\/images\/bike_2\/image5","..\/images\/bike_2\/image6","..\/images\/bike_2\/image7"],"shortDescription":"Our passionate team developed this electric bike (EAB) to make your urban rides and adventures more enjoyable: Get a helping hand while pedalling!<br>\n\n    Energise your urban commutes: when the wind is to your face, you're late for work, or when you're carrying a heavy load, the power sensor motor adapts to your effort. ","stock":18,"advantages":"<strong>Cycling comfort<\/strong><br>\n    Get improved comfort: ergonomic position, wide tyres, and suspension fork.<br><br>\n\n    <strong>Ease of use <\/strong><br>\n    Enhance your rides: central motor, 70 Nm torque, 7 speeds, and pannier rack! <br><br>\n\n    <strong>Bike safety <\/strong> <br>\n    Ride safely: LED lights, front disc brakes, and rear V-brake.<br><br>\n\n    <strong> Lifetime warranty <\/strong><br>\n    Keep it for a long time: Lifetime warranty on the frame, stem and handlebar.","technicalInfos":"<strong>Battery and motor:<\/strong><br> \n    250-watt central Brose motor (Drive T Alu) (complies with the European standard)<br>\n    Motor torque: 70 Nm. 36 volt\/11.6 Ah (418 Wh) battery, 2.6 kg, 2-year warranty (from 350 to 500 charge cycles to 100%) equipped with Samsung elements.<br>\n    Everything is controlled by an LCD dashboard with 3 modes + a 'walking' mode for pushing the bike while walking next to it.<br>\n    Its battery life is between 50 and 70 km: it varies depending on your weight, use, hills, outside temperature, assistance mode, etc.\n    How does an electric bike work?<br>\n    With its motor at the pedals and power sensor, the ELOPS 920 E adapts to you: the more energy you exert pedalling, the more the motor will help you. You therefore get the same feel as a classic bike.\n    And the battery? it is fitted with a charge indicator light and a lock with a key: remove and charge the battery at home or at the office and take it with you when you leave your bike outside!\n    Why opt for a high frame?<br>\n    For improved propulsion when you ride: with its aluminium frame, lighter weight but stiffer than steel, the power transfer from the motor is more efficient for better performance.\n    And since a high step through is even easier when your bike is the right height, here is our sizing guide:<br>\n    Size M is suitable for cyclists measuring 1.55m to 1.75m, size L is for cyclists measuring 1.75m to 1.95m.<br><br>\n    <strong>Fork<\/strong><br>\n    The electric city bike offers comfort and a getaway just outside your door! Even on cobblestone? Of course: with its non-adjustable, telescopic, suspension fork, your bike absorbs and filters vibrations on your route and softens shocks caused by the road's surface. Practical on cobblestones, pavement, and tramway rails...\n    A drivetrain with a hub, ever heard of it?\n    Your bike is equipped with a Shimano Nexus 7-speed derailleur controlled by a grip shifter. The drivetrain with a hub lets you change speeds without stopping. However, do not wait until you are riding downhill to change speeds.\n    And why are there different speeds on an EAB? Céline, our designer, explains: Because it is still a bike, not a moped! So depending on your route, you may want to change speeds: electric bikes are more efficient and the battery loses charge slower<br><br>\n    <strong>Brakes<\/strong><br>\n    We equipped your bike with Tektro aluminium brake levers for efficient, safe braking: they are lightweight and precise.<br>\n    Your bike also has mechanical disc callipers on the front wheel so that your brakes are powerful and progressive, even in the rain.\n    An aluminium seat post and a comfortable seat:\n    The aluminium seat post absorbs vibrations and the screw-in seat clamp collar limits the risk of theft. And the seat? This is our favourite part: after numerous tests, we chose this wide saddle whose foam padding has variable hardness to adapt to the pressure of your body in the saddle.\n    Why this one? Because it is by far the most comfortable!<br><br>\n    <strong>Tyres \/ wheels<\/strong><br>\n    We chose wide 28-inch tyres so that you can ride comfortably in town: a smooth rolling bike that can easily drive over small obstacles along the way. Not even cobblestones, sewer drains, potholes, or tramway rails can make you lose your balance! They are also equipped with reflective strips.<br>\n    And the rim? They are double-walled for improved durability and have 36 spokes.\n    Accessories and fittings to make your journey easier:<br>\n    We added a couple of details to make your urban rides easier:<br>\n    The pannier rack (max. load of 27kg), which can hold a baby carrier, is compatible with attachment systems for self-locking panniers and the bike is already equipped with a bell.<br>\n    The aluminium stand on the rear wheel is designed to support the weight of an EAB.\n    The bike also has mudguards and a chain guard so that you can arrive at work spotless.And of course, the bike comes with a charger.<br><br>\n    <strong>Lighting<\/strong><br>\n    No need to pedal to light it up: power is supplied by a battery.<br>\n    Your bike has a 20 lux LED light built into the frame, so that you can see 45 m ahead and be seen from 150 m behind.\n    The light is controlled on the handlebars, with the interface's screen. You're sure to be seen as it turns on as soon as you start the motor!\n    How to care for your electric bike<br>\n    It's normal for tyres to lose pressure over time: bike inner tubes are slightly porous. Don't forget to check your tyre pressure regularly.\n    Riding with under-inflated tyres reduces your battery range, requires more pedalling effort, and increases the risk of punctures. Before performing any work on your electric bike (cleaning, electrical or mechanical maintenance), you must turn off your electric bike and remove the battery.\n    User weight<br>\n    This electric bike (EAB) has been approved according to standard EN 15194 for a maximum weight of 125 kg (user and equipment such as: bags, baby seat, pannier, groceries,...)<br><br>\n    <strong>Warranty<\/strong><br>\n    Lifetime warranty on the frame and handlebar. Two years for the electric elements and spare parts<br><br>\n    <strong>Weight<\/strong><br>\n    25.2 kg","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium 6061<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":2,"name":"ROCKRIDER","price":"1299","tabImages":["..\/images\/bike_3\/image1","..\/images\/bike_3\/image2","..\/images\/bike_3\/image3","..\/images\/bike_3\/image5","..\/images\/bike_3\/image6","..\/images\/bike_3\/image7","..\/images\/bike_3\/image8"],"shortDescription":"This electric mountain bike is designed for MTB rides in the mountains. <br>\n    With the E-ST 520 electric mountain bike (EAMTB), you can tackle any climb with the help of its built-in motor (70 Nm torque).\n    Colour : Pale grey\/Fluo lime yellow","stock":15,"advantages":"<strong>Power<\/strong><br>\n\n    Head for the summit powered by a 250W motor with 70Nm torque<br><br>\n    <strong>Autonomy<\/strong><br>\n\n    Ride an average of 2.5 hours at a sporty pace thanks to the 420Wh battery.<br><br>\n    <strong>Smooth pedalling<\/strong><br>\n\n    The built-in motor automatically assists you when needed. Perfect for MTBing.<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Enjoy: raised position, 120 mm suspension, wide tyres, hammock Ergofit saddle.\n\n    <strong> Directional control <\/strong><br>\n    Control your trajectory: hydraulic fork and brakes, tyres and a wide handlebar.","technicalInfos":"<strong>Which is the right size?<\/strong><br>\n    Several sizes available:<br>\n    S: between 1.50m and 1.64m<br>\n    M: between 1.65 m and 1.74 m<br>\n    L: between 1.75 m and 1.84 m<br>\n    XL: between 1.85 m and 2.00 m<br>\n    If you are between 2 sizes:<br>\n    Choose the smaller size for easier steering (easier to handle) and comfort (straighter back).<br>\n    Choose the larger size for easier pedalling with a more stretched-out position (position more suited to performance).<br><br> <strong>IS ELECTRIC MTB A SPORT?<\/strong><br> You have to pedal to go forward!<br>\n    The electric assistance boosts your pedalling by 320%, helping you ride over obstacles.\n    You'll get to enjoy longer MTB rides.<br>\n    The motor stops providing electrical assistance when you stop pedalling.\n    The walking mode offsets the mountain bike's weight when you need to walk your bike.<br><br>\n    <strong>A WORD FROM THE TEAM<\/strong><br>\n    Our team of mountain bike enthusiasts created this E-ST 520 electric mountain bike entirely at our B'Twin Village in Lille, France.<br>\n    We designed and tested the E-ST 520 MTB by involving MTB riders at every stage of the project.\n    STURDY, PLAYFUL FRAME\n    The frame of the Rockrider E-ST 520 electric MTB is made of 6061 aluminium with hydroformed tubes. Why? The battery sits snugly on the frame to improve the robustness of this electric mountain bike.<br>\n    The forged aluminium parts make it compatible with the new 27.5 + tyre format (wider than the 27.5) in the rear, while remaining easy to manoeuvre. We've kept a frame geometry with short bases for easier steering.<br><br>\n    <strong>MOTOR WITH 70NM TORQUE<\/strong><br>\n    The BROSE T Aluminium central motor is specially designed for mountain biking:<br>\n    - 70 Nm torque to handle large obstacles and steep gradients<br>\n    - metal housing for maximum durability<br>\n    - belt for an ultra-quiet motor<br>\n    - sealed bearings to hold up to tough environments while mountain biking <br><br>\n\n    <strong>LG OR SAMSUNG BATTERY CELLS<\/strong><br>\n    Our battery is equipped with battery cells from LG or Samsung, (LGC-MG1 or SDI), which are known for their high level of reliability and safety.\n    Our battery supplier sources its minerals responsibly and sustainably, and is part of the Responsible Minerals Initiative.\n\n    <br><br><strong>BATTERY LOCK<\/strong><br>\n    Our Rockrider mountain bike team has designed a battery that locks in place with a simple lever. Child's play!<br>\n    This locking system prevents the battery vibrating when riding on rough terrain.\n    There is also a lock in case you want to stop your battery getting stolen. For example, if you park your bike in the street.\n\n    <br><br><strong>CONTROL SCREEN<\/strong><br>\n    A discreet LCD control screen. It is located just to the side of your left grip, so you can choose between the 3 assistance modes without letting go of the handlebars: (Deactivated), Economy, Standard, and Boost.\n    You'll also find a host of useful information:<br>\n    -Stopwatch<br>\n    -Current speed<br>\n    -Average speed<br>\n    -Maximum speed<br>\n    -Distance covered<br>\n    -Total distance<br>\n    -Battery level<br>\n    -Remaining battery range (in km)<br>\n    -Active assistance mode<br>\n    -Reset\n\n    <br><br><strong>3 ASSISTANCE MODES<\/strong><br>\n    Mode 0 - Deactivated\n    The battery is not used.<br>\n    Mode 1 - Economy +60%:\n    Extend your rides while conserving battery life. Ideal when you want a little push on small gradients.<br>\n    Mode 2 - Standard +120%:\n    This is the most versatile mode. Climb any slope without getting too tired and without using too much power.<br>\n    Mode 3 - Boost +320%\n\n    <br><br><strong>ROCKSHOX FRONT SUSPENSION<\/strong><br>\n    Ride over obstacles (roots, pebbles, stones, etc.) easily thanks to the Rockshox XC30 hydraulic fork with 120 mm of travel.\n    This fork has:<br>\n    - A coil spring for maximum sensitivity and reliability - a lockout and rebound adjustment for better control, depending on the terrain\n\n    <br><br><strong>SINGLE CHAINRING DRIVETRAIN<\/strong><br>\n    The E-ST520 electric bike is equipped with a single chainring and ChainFlow 3D anti-slip technology to prevent the chain from derailing.\n    A single shifter on the right handlebar makes it easy to shift between the 9 speeds.\n    In detail:<br>\n    -Chainflow & Anti-derailment single chainring with 34 teeth<br>\n    -Microshift Advent 9-speed rear derailleur with long cage<br>\n    -Microshift Advent right shifter<br>\n    -Microshift H093 9-speed cassette (11 to 42 teeth)<br>\n    -KMC E9 Sport electric bike specific chain\n    \n    <br><br><strong>WIDE 27.5 DOUBLE-WALLED RIMS<\/strong><br>\n    These wheels were specially designed for this mountain bike:<br>\n    - 23 mm rims (width between brackets), 28 spokes at the front and 32 spokes at the rear, for greater durability and good grip with wide tyres (up to 2.5).<br>\n    - BOOST thru rear axle (12x148) for greater durability<br>\n    - Aluminium hubs with sealed bearings<br>\n    - TUBELESS READY rims: you will need TUBELESS tyres, specific Presta valves, and puncture sealant.\t\n\n    <br><br><strong>HUTCHINSON TYRES<\/strong><br>\n    In order for you to feel safe on any terrain, and for traction suited to your motor, the E-ST520 electric MTB is equipped with Hutchinson Cougar 27.5 tyres with a 2.4 cross-section. Our test riders particularly liked these tyres for their grip on the ground. Mounted on wide rims, these tyres provide great grip, traction, and comfort on any terrain.\n\n    <br><br><strong>HYDRAULIC DISC BRAKES<\/strong><br>\n    Regardless of the conditions you ride in (dry\/wet\/muddy), the hydraulic Tektro TKD88 disc brakes at the front and rear provide powerful and progressive braking. Oversized 180mm diameter discs provide even more power.\n\n    <br><br><strong>HANDLEBARS, STEM, GRIPS<\/strong><br>\n    The adjustable stem brings the E-ST 520 controls to your hands. The all-aluminium Rockrider stem is 70 mm (size S), 80 mm (size M\/L), or 90 mm (size XL) and can be raised to 5 adjustment intervals: + 0mm, + 7.5mm, + 15mm, + 22.5mm, + 30mm.\n    In detail:<br>\n    - 720mm oversize Rockrider Sport aluminium handlebar<br>\n    - Rockrider Sport soft touch ergonomic grips for good grip and a comfortable feel.\n\n    <br><br><strong>Saddle<\/strong><br>\n    Since your mountain bike rides will get longer and longer, it is important to have a suitable seat. Our teams have designed the exclusive Rockrider Ergofit Evo saddle. It fits all hip sizes and has a curved shape that is particularly good for sport trail rides.\n    The 31.6 mm aluminium seat post ensures compatibility with most adjustable and suspended seat posts on the market.\n    Platform pedals\n    The bike comes with 520 GRIP MTB platform pedals (ref. 8487130) with a wider pedalling surface and more pronounced dots for better grip on the pedal.However, if you are looking for improved performance when pedalling and better control of the bike when cycling, we recommend replacing them with clipless pedals with platforms or wide aluminium platform pedals.\n\n    <br><br><strong>Accessories<\/strong><br>\n    Your E-ST520 mountain bike is fitted with a bell, lights, wheel reflectors and pedals.\n    The frame is compatible with:<br>\n    - front and rear mudguards<br>\n    - stand<br>\n    - bottle cage (on the horizontal tube)<br>\n    - saddle pouch<br>\n    - rear pannier rack (fixed onto the seat stays or special mounts for wide bikes, 148 mm gap for the rear wheel & 2.8 fat tire)<br>\n    - child seat\n    ...\n\n    <br><br><strong>OUR ADVICE FOR YOUR FIRST RIDES<\/strong><br>\n    Tip no.1: \n    When mountain biking, there is always the risk of a fall: don't forget to wear a helmet.<br>\n    Tip no. 2: \n    A puncture could happen at any time, so always remember to take a repair kit and a 6 mm Allen key for removing your wheels.<br>\n    Tip no.3: \n    If you don't want to stop to drink, bring water in a bottle or water bladder to access it while riding.\n\n    <br><br><strong>LEGAL DISCLAIMER<\/strong><br>\n    To ensure components last longer, we recommend a maximum load of 120 kg (rider and MTB included).\n    \n    <br><br><strong>Care advice<\/strong><br>\n    Leave your battery on the bike when washing using a hose. This will protect the connectors from rusting.\n    <br><br><strong>Warranty<\/strong><br>\n    Lifetime (frame, stem, handlebar). Availability of spare parts: 2 years.Guaranteed for 500 charges.\n    <br><br><strong>Weight<\/strong><br>\n    22.5 kg. \n    Weight without pedals.\n    ","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium 6061<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Store it in a warm, dry place away from corrosive products and salty air. Never store with the battery flat, and remember to recharge it at least once every six months.<br><br>\n    <strong>User Directions<\/strong><br>\n    Don't forget to remove the battery to handle the chain.\n    <br><br><strong>TESTS<\/strong><br>\n    Our engineers always have real riders test all our products in real conditions. These tests round out our lab tests and let us validate all our products before they hit store shelves.\n    <br><br><strong>Legal Mentions<\/strong><br>\n    To ensure components last longer, we recommend a maximum load of 120 kg (rider and MTB included).<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":3,"name":"BTWIN-3","price":"899","tabImages":["..\/images\/bike_4\/image1","..\/images\/bike_4\/image2","..\/images\/bike_4\/image3","..\/images\/bike_4\/image5","..\/images\/bike_4\/image6","..\/images\/bike_4\/image7","..\/images\/bike_4\/image8"],"shortDescription":"Our team of passionate designers developed this electric bike to give your rides on roads and trails that extra bit of oomph!<br><br>\n\n    Easily break up your rides! Use the electrical assistance to extend your efforts and feel the difference with a range of up to 90km. <\/br><\/br>","stock":5,"advantages":"<strong>Autonomy<\/strong><br>\n\n    Mode 1: up to 90 km, mode 2: up to 70 km, mode 3: up to 50 km.<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Front\/rear suspension, ergonomic grips and gel saddle.<br><br>\n    <strong>Ease of use<\/strong><br>\n\n    Change gear with a single motion using the 7-speed trigger.<br><br>\n    <strong>Easy reading<\/strong><br>\n\n    Wide, contrasted, accessible from the handlebars. Keep an eye on your screen.\n    <strong>Adjustable <\/strong>\n\n    <br><br>Height- and tilt-adjustable saddle and handlebars: optimised comfort. \n    ","technicalInfos":"<strong>How to choose your size <\/strong><br>\n    2 sizes available:<br>\n    Size S\/M from 1.45m to 1.74m.<br>\n    Size L\/XL from 1.75m to 1.95m.<br>\n    If youre between 2 sizes:<br>\n    Choose the smaller size for greater manoeuvrability and comfort (straighter back).<br>\n    Choose the larger size for a more stretched out position (more suited to speed).\n    <br><br> <strong>0, 1, 2 or 3: choosing your assistance mode<\/strong> Walking mode - Assistance when walking.<br>\n    Mode 0 – Assistance disabled.<br>\n    Mode 1 - Assistance up to 17 km\/h - battery life of up to 90 km under normal conditions.<br>\n    Mode 2 - Assistance up to 22 km\/h - battery life of up to 70 km under normal conditions.<br><br>\n    Mode 3 - Assistance up to 25 km\/h - battery life of up to 50 km under normal conditions. (please note: your battery life will be severely reduced in the event of prolonged use).<br>\n    Motor: use those watts!\n    Brushless 250-watt motor in the rear wheel hub.\n    30Nm torque.\n    \n    <br><br>\n    <strong>Battery<\/strong><br>\n    \n    lithium-ion 36v 11.6 Ah (418Wh).\n    Supplied with two lock keys.Charge time: 6.5 hours\n    Its weight: 2.64 kg.\n    We recommend recharging the battery after each use.\n    To put it to sleep: press the stop\/start button on the battery for 10 seconds until the LEDs switch off.\n    Your battery is guaranteed for 2 years or 500 cycles (1 cycle = 1 full charge + 1 full discharge or two 50% charges + two 50% discharges).<br><br>\n    <strong>Backlit control screen<\/strong><br>\n    LCD screen, backlit for better visibility both day and night.\n    Displays: Speed, distance covered and overall, the remaining power and the mode.\n    To access this data, press the Walk\/Stop button.<br>\n    USB port for charging your smartphone.\n    A full suspension frame designed for an easy ride<br>\n    Our engineers designed this hybrid aluminium frame with lower geometry to make it easier to get on the bike. This frame provides greater comfort than ever.\n    The Original 900 E is equipped with a SUNTOUR spring front suspension fork (1 1\/8 pivot in steel) with 63mm travel and rear spring suspension. To adjust the rear suspension, turn the locking ring located directly behind it (this can be done without tools).\n    Derailleurs and drivetrain: enjoy the speed!\n    <br><br><strong>7 speeds which use a quick and easy to use trigger to change between them.<\/strong><br>\n    In detail:<br>\n    - Shimano TZ 500 7-speed freewheel.<br>\n    - Single chainwheel: 38 teeth<br>- Cogs: 14 \/ 28.- Anti-corrosion chain.<br>\n    - Rear derailleur: SRAM X3.- SRAM Trigger x - 3 shifter.<br>\n    - Anti-derailment ring.\n    Hybrid tyres: put rubber to the road<br>\n    The Original 920 E is equipped with B'Twin Trekking hybrid road and trail tyres so you can go anywhere.\n    The recommended pressure is a minimum of 3.0 bar and a maximum of 4.0 bar (details on tyre sidewall).\n    <br><br><string>Dimensions:<\/string><br>\n    - Size S\/M: 26x 1.75.<br>\n    - Size L\/XL: 28 x 1.75.<br>\n    Bonus: Self-healing inner tube.\n    Double-walled wheels\n    Set off on an adventure with the Original 920 E equipped with double-walled aluminium wheels.\n    To transport your bike, the quick-release on the front wheel makes it easy to remove.\n    36-spoke front and rear wheels.\n    <br><br><strong>Wheel diameter:<\/strong><br>\n    - Size S\/M: 26 inches.<br>\n    - Size L\/XL: 28 inches.<br>\n    Brake safely\n    Two V-Brake pads for effective braking.\n    The two steel callipers are equipped with pads that exercise pressure on the rim to slow or stop the rotation of the wheels.\n    Aluminium brake levers.\n    Handlebars, steering, stem: maintain control\n    Semi-raised steel handlebars (620mm).\n    1 aluminium stem 90mm long, adjustable and tiltable.\n    B'Twin ergonomic grips.\n    Saddle be comfortable\n    Because it's important that your seat position is adapted to your riding style, our teams developed the exclusive B'Twin Ergofit gel saddle.\n    Graduated aluminium seat post for easier adjustment.<br>\n    Collar dimensions = 32mm.<br>\n    Seat post diameter = 27.2mm.<br>\n    Tool-free saddle height adjustment (quick-release).\n    Crankset \/ Pedals\n    The Original 920 E is supplied with hybrid one-piece plastic pedals.\n    170mm long aluminium cranks.\n    38-tooth aluminium chainwheel.\n    Plastic chainguard.\n    <br><br><strong>Accessories<\/strong><br>\n    Your Original 920 E is supplied with a bell, lights (front\/rear), wheel reflectors and pedals.\n    Depending on the accessory type and size of the bike, the frame is compatible with:<br>\n    - saddle bag<br>\n    - rear pannier<br>\n    - front pannier<br>\n    This bike isnt compatible with any kind of child seat, whatever the mounting system used\n    For further information, dont hesitate to ask one of our sales assistants.\n    Difference with the Original 900E\n    The 920E has a new set of electrics.\n    The 900 and 920 share the same motor and battery. But despite that, the 920 has a longer battery life.<br>\n    How is this possible? <br>\n    The 900 model tended to give you a lot of energy with each turn of the pedal. This caused jerkiness and wasted energy.\n    The 920 model provides energy more smoothly, so it s more comfortable to ride and doesnt waste so much of the motor s energy.\n    Warranty\n    <br><br><strong>Lifetime guarantee:<\/strong><br> stem and handlebars, Battery and parts: 2 years.\n    <br><br><strong>Weight<\/strong><br>\n    M : 25.5 kg<br>\n    L : 26 kg","productComposition":"n<\/strong><br>\n    Frame 100% Aluminium<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Store in a dry place.When storing for a prolonged period, put the battery in sleep mode. Do not store the battery discharged (1 green LED flashing).<br><br>\n    <strong>TESTS<\/strong><br>\n    Before reaching stores, our bikes are tested by many hybrid bike enthusiasts. They ride several thousands of kilometres to be properly approved. These tests enable us to guarantee comfort, ease of use and versatility to meet your expectations.<br><br>\n    <strong>User Directions<\/strong><br>\n    Not suitable for mountain bikes and BMX.\n    <br><br><strong>Legal Mentions<\/strong><br>\n    The total weight (bike+cyclist) should not exceed 120kg. Not suitable for children under age 14 years.\n    \n    <br><br><strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":0,"name":"BTWIN-1","price":"899","tabImages":["..\/images\/bike_1\/image1","..\/images\/bike_1\/image2","..\/images\/bike_1\/image3","..\/images\/bike_1\/image5","..\/images\/bike_1\/image6","..\/images\/bike_1\/image7","..\/images\/bike_1\/image8"],"shortDescription":"You ride regularly and want to benefit from assisted pedalling. The Tilt 500 E folds 3 times so that you can go further.<br><br>Are you looking for an electric bike that's easy to take with you? The TILT 500 E fits in your car boot and is perfect for weekday commutes and weekend rides of up to 35 km.<\/br><\/br>","stock":11,"advantages":"<strong>Easy transport<\/strong><br>\n\n    Ride, fold, carry, store: 15s is all you need. You can't ride it when folded.<br><br>\n    <strong>Versatility<\/strong><br>\n\n    Enjoy limitless adventures with electric assistance and 6 speeds!<br><br>\n    <strong>Compact design<\/strong><br>\n\n    Folded L\/H\/W: 83 x 67 x 45 cm.Unfolded L\/H\/W: 155 x 114 x 60 cm<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Ergonomic grips and saddle, height-adjustable stem\n    <strong>Lifetime warranty <\/strong>\n\n    <br><br>B'Twin offers a lifetime warranty on the frame (excl. hinge), stem and handlebar","technicalInfos":"<strong>Motor \/ battery <\/strong><br>\n    Battery range: 35 km in economy mode\/25 km in normal mode\/20 km in sport mode (indicative information that may vary depending on the tyre pressure, the terrain, the conditions, and the weight of the rider).<br>\n    Battery: lifespan of 350 to 500 charge cycles.<br><br> <strong>Warranty:<\/strong> 2 years.250W brushless motor, 24V battery built into frame, 7.8 Ah electric assistance controlled by pedalling sensors.<br>\n\n    Motor torque: 26<br>\n    Battery and charger supplied with the bike\n    Frame<br>\n    Aluminium frame with built-in battery. The battery can be charged directly through the frame, or can be removed from its housing to be recharged at home or at work.Frame compatible with the B'Twin TILT 20-inch pannier rack.<br><br>\n    <strong>Fork<\/strong><br>\n    \n    Steel fork.\n    Drivetrain\n    6 speeds with Shimano grip shifter. Shimano Tourney 6-speed rear derailleur. 52-teeth chainring.<br><br>\n    <strong>Brakes<\/strong><br>\n    Aluminium V-Brake callipers for powerful, progressive braking.\n    Aluminium levers with rubber pads for added comfort. Braking cuts out electric assistance.\n    <br><br><strong>Remember:<\/strong><br> The brake pads on electrically-assisted bikes wear down more quickly than a classic bike due to the weight and power of the motor.<br>\n    Handlebar \/ stem \/ steering\n    Fold-down, height-adjustable aluminium stem for added comfort.\n    Quick release with automatic safety lever\n    Semi-raised aluminium handlebar.\n    Saddle \/ Seat post\n    Anti-theft, anti-rotation aluminium seat post 34mm in diameter.<br><br>\n    <strong>Tyres \/ wheels<\/strong><br>\n    Tyres with anti-puncture reinforcement.\n    Size 20 x 1.75.<br>\n    We've developed these tyres using Skinwall technology for lower weight and higher performance.\n    Double-walled rims for greater rigidity.<br>\n    Motor built into the rear wheel for improved steering control.<br><br>\n    <strong>Accessories\/Equipment<\/strong><br>\n    Battery-powered front and rear lights with handlebar control.This bike is compatible with the TILT transport cover and the B'TWIN pannier rack for foldable bikes.\n    The Tilt 500 E is not compatible with a child seat or a trailer.\n    Care tips<br>\n    Tyres lose pressure over time. On average, they lose 1 bar\/week.\n    So remember to regularly pump up your tyres. Riding with under-inflated tyres reduces your battery range, requires more pedalling effort, and increases the risk of punctures.\n    Before performing any work on your electric bike (cleaning, electrical or mechanical maintenance), you must turn off your electric bike and remove the battery.<br>\n    If you are not using your bike over the winter, charge it at least every 12 months.\n    User size and weight\n    The geometry of this bike offers optimal comfort for cyclists measuring between 1.45m and 1.85m.\n    This bike meets the requirements of the ISO 4210 standard for a cyclist weighing 100kg.<br><br>\n    <strong>Warranty<\/strong><br>\n    Lifetime warranty on the frame, stem (excl. hinge), rigid fork and handlebar.<br><br>\n    <strong>Weight<\/strong><br>\n    18.6 kg","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Recharge the battery after each use. If it is flat, charge it as soon as possible. Irreparable damage may occur if the battery remains flat for too long.<br><br>\n    <strong>User Directions<\/strong><br>\n    Not suitable for tricks.Meets standard for a 100kg cyclist<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":1,"name":"BTWIN-2","price":"500","tabImages":["..\/images\/bike_2\/image1","..\/images\/bike_2\/image2","..\/images\/bike_2\/image3","..\/images\/bike_2\/image4","..\/images\/bike_2\/image5","..\/images\/bike_2\/image6","..\/images\/bike_2\/image7"],"shortDescription":"Our passionate team developed this electric bike (EAB) to make your urban rides and adventures more enjoyable: Get a helping hand while pedalling!<br>\n\n    Energise your urban commutes: when the wind is to your face, you're late for work, or when you're carrying a heavy load, the power sensor motor adapts to your effort. ","stock":18,"advantages":"<strong>Cycling comfort<\/strong><br>\n    Get improved comfort: ergonomic position, wide tyres, and suspension fork.<br><br>\n\n    <strong>Ease of use <\/strong><br>\n    Enhance your rides: central motor, 70 Nm torque, 7 speeds, and pannier rack! <br><br>\n\n    <strong>Bike safety <\/strong> <br>\n    Ride safely: LED lights, front disc brakes, and rear V-brake.<br><br>\n\n    <strong> Lifetime warranty <\/strong><br>\n    Keep it for a long time: Lifetime warranty on the frame, stem and handlebar.","technicalInfos":"<strong>Battery and motor:<\/strong><br> \n    250-watt central Brose motor (Drive T Alu) (complies with the European standard)<br>\n    Motor torque: 70 Nm. 36 volt\/11.6 Ah (418 Wh) battery, 2.6 kg, 2-year warranty (from 350 to 500 charge cycles to 100%) equipped with Samsung elements.<br>\n    Everything is controlled by an LCD dashboard with 3 modes + a 'walking' mode for pushing the bike while walking next to it.<br>\n    Its battery life is between 50 and 70 km: it varies depending on your weight, use, hills, outside temperature, assistance mode, etc.\n    How does an electric bike work?<br>\n    With its motor at the pedals and power sensor, the ELOPS 920 E adapts to you: the more energy you exert pedalling, the more the motor will help you. You therefore get the same feel as a classic bike.\n    And the battery? it is fitted with a charge indicator light and a lock with a key: remove and charge the battery at home or at the office and take it with you when you leave your bike outside!\n    Why opt for a high frame?<br>\n    For improved propulsion when you ride: with its aluminium frame, lighter weight but stiffer than steel, the power transfer from the motor is more efficient for better performance.\n    And since a high step through is even easier when your bike is the right height, here is our sizing guide:<br>\n    Size M is suitable for cyclists measuring 1.55m to 1.75m, size L is for cyclists measuring 1.75m to 1.95m.<br><br>\n    <strong>Fork<\/strong><br>\n    The electric city bike offers comfort and a getaway just outside your door! Even on cobblestone? Of course: with its non-adjustable, telescopic, suspension fork, your bike absorbs and filters vibrations on your route and softens shocks caused by the road's surface. Practical on cobblestones, pavement, and tramway rails...\n    A drivetrain with a hub, ever heard of it?\n    Your bike is equipped with a Shimano Nexus 7-speed derailleur controlled by a grip shifter. The drivetrain with a hub lets you change speeds without stopping. However, do not wait until you are riding downhill to change speeds.\n    And why are there different speeds on an EAB? Céline, our designer, explains: Because it is still a bike, not a moped! So depending on your route, you may want to change speeds: electric bikes are more efficient and the battery loses charge slower<br><br>\n    <strong>Brakes<\/strong><br>\n    We equipped your bike with Tektro aluminium brake levers for efficient, safe braking: they are lightweight and precise.<br>\n    Your bike also has mechanical disc callipers on the front wheel so that your brakes are powerful and progressive, even in the rain.\n    An aluminium seat post and a comfortable seat:\n    The aluminium seat post absorbs vibrations and the screw-in seat clamp collar limits the risk of theft. And the seat? This is our favourite part: after numerous tests, we chose this wide saddle whose foam padding has variable hardness to adapt to the pressure of your body in the saddle.\n    Why this one? Because it is by far the most comfortable!<br><br>\n    <strong>Tyres \/ wheels<\/strong><br>\n    We chose wide 28-inch tyres so that you can ride comfortably in town: a smooth rolling bike that can easily drive over small obstacles along the way. Not even cobblestones, sewer drains, potholes, or tramway rails can make you lose your balance! They are also equipped with reflective strips.<br>\n    And the rim? They are double-walled for improved durability and have 36 spokes.\n    Accessories and fittings to make your journey easier:<br>\n    We added a couple of details to make your urban rides easier:<br>\n    The pannier rack (max. load of 27kg), which can hold a baby carrier, is compatible with attachment systems for self-locking panniers and the bike is already equipped with a bell.<br>\n    The aluminium stand on the rear wheel is designed to support the weight of an EAB.\n    The bike also has mudguards and a chain guard so that you can arrive at work spotless.And of course, the bike comes with a charger.<br><br>\n    <strong>Lighting<\/strong><br>\n    No need to pedal to light it up: power is supplied by a battery.<br>\n    Your bike has a 20 lux LED light built into the frame, so that you can see 45 m ahead and be seen from 150 m behind.\n    The light is controlled on the handlebars, with the interface's screen. You're sure to be seen as it turns on as soon as you start the motor!\n    How to care for your electric bike<br>\n    It's normal for tyres to lose pressure over time: bike inner tubes are slightly porous. Don't forget to check your tyre pressure regularly.\n    Riding with under-inflated tyres reduces your battery range, requires more pedalling effort, and increases the risk of punctures. Before performing any work on your electric bike (cleaning, electrical or mechanical maintenance), you must turn off your electric bike and remove the battery.\n    User weight<br>\n    This electric bike (EAB) has been approved according to standard EN 15194 for a maximum weight of 125 kg (user and equipment such as: bags, baby seat, pannier, groceries,...)<br><br>\n    <strong>Warranty<\/strong><br>\n    Lifetime warranty on the frame and handlebar. Two years for the electric elements and spare parts<br><br>\n    <strong>Weight<\/strong><br>\n    25.2 kg","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium 6061<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":2,"name":"ROCKRIDER","price":"1299","tabImages":["..\/images\/bike_3\/image1","..\/images\/bike_3\/image2","..\/images\/bike_3\/image3","..\/images\/bike_3\/image5","..\/images\/bike_3\/image6","..\/images\/bike_3\/image7","..\/images\/bike_3\/image8"],"shortDescription":"This electric mountain bike is designed for MTB rides in the mountains. <br>\n    With the E-ST 520 electric mountain bike (EAMTB), you can tackle any climb with the help of its built-in motor (70 Nm torque).\n    Colour : Pale grey\/Fluo lime yellow","stock":15,"advantages":"<strong>Power<\/strong><br>\n\n    Head for the summit powered by a 250W motor with 70Nm torque<br><br>\n    <strong>Autonomy<\/strong><br>\n\n    Ride an average of 2.5 hours at a sporty pace thanks to the 420Wh battery.<br><br>\n    <strong>Smooth pedalling<\/strong><br>\n\n    The built-in motor automatically assists you when needed. Perfect for MTBing.<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Enjoy: raised position, 120 mm suspension, wide tyres, hammock Ergofit saddle.\n\n    <strong> Directional control <\/strong><br>\n    Control your trajectory: hydraulic fork and brakes, tyres and a wide handlebar.","technicalInfos":"<strong>Which is the right size?<\/strong><br>\n    Several sizes available:<br>\n    S: between 1.50m and 1.64m<br>\n    M: between 1.65 m and 1.74 m<br>\n    L: between 1.75 m and 1.84 m<br>\n    XL: between 1.85 m and 2.00 m<br>\n    If you are between 2 sizes:<br>\n    Choose the smaller size for easier steering (easier to handle) and comfort (straighter back).<br>\n    Choose the larger size for easier pedalling with a more stretched-out position (position more suited to performance).<br><br> <strong>IS ELECTRIC MTB A SPORT?<\/strong><br> You have to pedal to go forward!<br>\n    The electric assistance boosts your pedalling by 320%, helping you ride over obstacles.\n    You'll get to enjoy longer MTB rides.<br>\n    The motor stops providing electrical assistance when you stop pedalling.\n    The walking mode offsets the mountain bike's weight when you need to walk your bike.<br><br>\n    <strong>A WORD FROM THE TEAM<\/strong><br>\n    Our team of mountain bike enthusiasts created this E-ST 520 electric mountain bike entirely at our B'Twin Village in Lille, France.<br>\n    We designed and tested the E-ST 520 MTB by involving MTB riders at every stage of the project.\n    STURDY, PLAYFUL FRAME\n    The frame of the Rockrider E-ST 520 electric MTB is made of 6061 aluminium with hydroformed tubes. Why? The battery sits snugly on the frame to improve the robustness of this electric mountain bike.<br>\n    The forged aluminium parts make it compatible with the new 27.5 + tyre format (wider than the 27.5) in the rear, while remaining easy to manoeuvre. We've kept a frame geometry with short bases for easier steering.<br><br>\n    <strong>MOTOR WITH 70NM TORQUE<\/strong><br>\n    The BROSE T Aluminium central motor is specially designed for mountain biking:<br>\n    - 70 Nm torque to handle large obstacles and steep gradients<br>\n    - metal housing for maximum durability<br>\n    - belt for an ultra-quiet motor<br>\n    - sealed bearings to hold up to tough environments while mountain biking <br><br>\n\n    <strong>LG OR SAMSUNG BATTERY CELLS<\/strong><br>\n    Our battery is equipped with battery cells from LG or Samsung, (LGC-MG1 or SDI), which are known for their high level of reliability and safety.\n    Our battery supplier sources its minerals responsibly and sustainably, and is part of the Responsible Minerals Initiative.\n\n    <br><br><strong>BATTERY LOCK<\/strong><br>\n    Our Rockrider mountain bike team has designed a battery that locks in place with a simple lever. Child's play!<br>\n    This locking system prevents the battery vibrating when riding on rough terrain.\n    There is also a lock in case you want to stop your battery getting stolen. For example, if you park your bike in the street.\n\n    <br><br><strong>CONTROL SCREEN<\/strong><br>\n    A discreet LCD control screen. It is located just to the side of your left grip, so you can choose between the 3 assistance modes without letting go of the handlebars: (Deactivated), Economy, Standard, and Boost.\n    You'll also find a host of useful information:<br>\n    -Stopwatch<br>\n    -Current speed<br>\n    -Average speed<br>\n    -Maximum speed<br>\n    -Distance covered<br>\n    -Total distance<br>\n    -Battery level<br>\n    -Remaining battery range (in km)<br>\n    -Active assistance mode<br>\n    -Reset\n\n    <br><br><strong>3 ASSISTANCE MODES<\/strong><br>\n    Mode 0 - Deactivated\n    The battery is not used.<br>\n    Mode 1 - Economy +60%:\n    Extend your rides while conserving battery life. Ideal when you want a little push on small gradients.<br>\n    Mode 2 - Standard +120%:\n    This is the most versatile mode. Climb any slope without getting too tired and without using too much power.<br>\n    Mode 3 - Boost +320%\n\n    <br><br><strong>ROCKSHOX FRONT SUSPENSION<\/strong><br>\n    Ride over obstacles (roots, pebbles, stones, etc.) easily thanks to the Rockshox XC30 hydraulic fork with 120 mm of travel.\n    This fork has:<br>\n    - A coil spring for maximum sensitivity and reliability - a lockout and rebound adjustment for better control, depending on the terrain\n\n    <br><br><strong>SINGLE CHAINRING DRIVETRAIN<\/strong><br>\n    The E-ST520 electric bike is equipped with a single chainring and ChainFlow 3D anti-slip technology to prevent the chain from derailing.\n    A single shifter on the right handlebar makes it easy to shift between the 9 speeds.\n    In detail:<br>\n    -Chainflow & Anti-derailment single chainring with 34 teeth<br>\n    -Microshift Advent 9-speed rear derailleur with long cage<br>\n    -Microshift Advent right shifter<br>\n    -Microshift H093 9-speed cassette (11 to 42 teeth)<br>\n    -KMC E9 Sport electric bike specific chain\n    \n    <br><br><strong>WIDE 27.5 DOUBLE-WALLED RIMS<\/strong><br>\n    These wheels were specially designed for this mountain bike:<br>\n    - 23 mm rims (width between brackets), 28 spokes at the front and 32 spokes at the rear, for greater durability and good grip with wide tyres (up to 2.5).<br>\n    - BOOST thru rear axle (12x148) for greater durability<br>\n    - Aluminium hubs with sealed bearings<br>\n    - TUBELESS READY rims: you will need TUBELESS tyres, specific Presta valves, and puncture sealant.\t\n\n    <br><br><strong>HUTCHINSON TYRES<\/strong><br>\n    In order for you to feel safe on any terrain, and for traction suited to your motor, the E-ST520 electric MTB is equipped with Hutchinson Cougar 27.5 tyres with a 2.4 cross-section. Our test riders particularly liked these tyres for their grip on the ground. Mounted on wide rims, these tyres provide great grip, traction, and comfort on any terrain.\n\n    <br><br><strong>HYDRAULIC DISC BRAKES<\/strong><br>\n    Regardless of the conditions you ride in (dry\/wet\/muddy), the hydraulic Tektro TKD88 disc brakes at the front and rear provide powerful and progressive braking. Oversized 180mm diameter discs provide even more power.\n\n    <br><br><strong>HANDLEBARS, STEM, GRIPS<\/strong><br>\n    The adjustable stem brings the E-ST 520 controls to your hands. The all-aluminium Rockrider stem is 70 mm (size S), 80 mm (size M\/L), or 90 mm (size XL) and can be raised to 5 adjustment intervals: + 0mm, + 7.5mm, + 15mm, + 22.5mm, + 30mm.\n    In detail:<br>\n    - 720mm oversize Rockrider Sport aluminium handlebar<br>\n    - Rockrider Sport soft touch ergonomic grips for good grip and a comfortable feel.\n\n    <br><br><strong>Saddle<\/strong><br>\n    Since your mountain bike rides will get longer and longer, it is important to have a suitable seat. Our teams have designed the exclusive Rockrider Ergofit Evo saddle. It fits all hip sizes and has a curved shape that is particularly good for sport trail rides.\n    The 31.6 mm aluminium seat post ensures compatibility with most adjustable and suspended seat posts on the market.\n    Platform pedals\n    The bike comes with 520 GRIP MTB platform pedals (ref. 8487130) with a wider pedalling surface and more pronounced dots for better grip on the pedal.However, if you are looking for improved performance when pedalling and better control of the bike when cycling, we recommend replacing them with clipless pedals with platforms or wide aluminium platform pedals.\n\n    <br><br><strong>Accessories<\/strong><br>\n    Your E-ST520 mountain bike is fitted with a bell, lights, wheel reflectors and pedals.\n    The frame is compatible with:<br>\n    - front and rear mudguards<br>\n    - stand<br>\n    - bottle cage (on the horizontal tube)<br>\n    - saddle pouch<br>\n    - rear pannier rack (fixed onto the seat stays or special mounts for wide bikes, 148 mm gap for the rear wheel & 2.8 fat tire)<br>\n    - child seat\n    ...\n\n    <br><br><strong>OUR ADVICE FOR YOUR FIRST RIDES<\/strong><br>\n    Tip no.1: \n    When mountain biking, there is always the risk of a fall: don't forget to wear a helmet.<br>\n    Tip no. 2: \n    A puncture could happen at any time, so always remember to take a repair kit and a 6 mm Allen key for removing your wheels.<br>\n    Tip no.3: \n    If you don't want to stop to drink, bring water in a bottle or water bladder to access it while riding.\n\n    <br><br><strong>LEGAL DISCLAIMER<\/strong><br>\n    To ensure components last longer, we recommend a maximum load of 120 kg (rider and MTB included).\n    \n    <br><br><strong>Care advice<\/strong><br>\n    Leave your battery on the bike when washing using a hose. This will protect the connectors from rusting.\n    <br><br><strong>Warranty<\/strong><br>\n    Lifetime (frame, stem, handlebar). Availability of spare parts: 2 years.Guaranteed for 500 charges.\n    <br><br><strong>Weight<\/strong><br>\n    22.5 kg. \n    Weight without pedals.\n    ","productComposition":"<strong>Product Composition<\/strong><br>\n    Frame 100% Aluminium 6061<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Store it in a warm, dry place away from corrosive products and salty air. Never store with the battery flat, and remember to recharge it at least once every six months.<br><br>\n    <strong>User Directions<\/strong><br>\n    Don't forget to remove the battery to handle the chain.\n    <br><br><strong>TESTS<\/strong><br>\n    Our engineers always have real riders test all our products in real conditions. These tests round out our lab tests and let us validate all our products before they hit store shelves.\n    <br><br><strong>Legal Mentions<\/strong><br>\n    To ensure components last longer, we recommend a maximum load of 120 kg (rider and MTB included).<br><br>\n    <strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},{"id":3,"name":"BTWIN-3","price":"899","tabImages":["..\/images\/bike_4\/image1","..\/images\/bike_4\/image2","..\/images\/bike_4\/image3","..\/images\/bike_4\/image5","..\/images\/bike_4\/image6","..\/images\/bike_4\/image7","..\/images\/bike_4\/image8"],"shortDescription":"Our team of passionate designers developed this electric bike to give your rides on roads and trails that extra bit of oomph!<br><br>\n\n    Easily break up your rides! Use the electrical assistance to extend your efforts and feel the difference with a range of up to 90km. <\/br><\/br>","stock":5,"advantages":"<strong>Autonomy<\/strong><br>\n\n    Mode 1: up to 90 km, mode 2: up to 70 km, mode 3: up to 50 km.<br><br>\n    <strong>Cycling comfort<\/strong><br>\n\n    Front\/rear suspension, ergonomic grips and gel saddle.<br><br>\n    <strong>Ease of use<\/strong><br>\n\n    Change gear with a single motion using the 7-speed trigger.<br><br>\n    <strong>Easy reading<\/strong><br>\n\n    Wide, contrasted, accessible from the handlebars. Keep an eye on your screen.\n    <strong>Adjustable <\/strong>\n\n    <br><br>Height- and tilt-adjustable saddle and handlebars: optimised comfort. \n    ","technicalInfos":"<strong>How to choose your size <\/strong><br>\n    2 sizes available:<br>\n    Size S\/M from 1.45m to 1.74m.<br>\n    Size L\/XL from 1.75m to 1.95m.<br>\n    If youre between 2 sizes:<br>\n    Choose the smaller size for greater manoeuvrability and comfort (straighter back).<br>\n    Choose the larger size for a more stretched out position (more suited to speed).\n    <br><br> <strong>0, 1, 2 or 3: choosing your assistance mode<\/strong> Walking mode - Assistance when walking.<br>\n    Mode 0 – Assistance disabled.<br>\n    Mode 1 - Assistance up to 17 km\/h - battery life of up to 90 km under normal conditions.<br>\n    Mode 2 - Assistance up to 22 km\/h - battery life of up to 70 km under normal conditions.<br><br>\n    Mode 3 - Assistance up to 25 km\/h - battery life of up to 50 km under normal conditions. (please note: your battery life will be severely reduced in the event of prolonged use).<br>\n    Motor: use those watts!\n    Brushless 250-watt motor in the rear wheel hub.\n    30Nm torque.\n    \n    <br><br>\n    <strong>Battery<\/strong><br>\n    \n    lithium-ion 36v 11.6 Ah (418Wh).\n    Supplied with two lock keys.Charge time: 6.5 hours\n    Its weight: 2.64 kg.\n    We recommend recharging the battery after each use.\n    To put it to sleep: press the stop\/start button on the battery for 10 seconds until the LEDs switch off.\n    Your battery is guaranteed for 2 years or 500 cycles (1 cycle = 1 full charge + 1 full discharge or two 50% charges + two 50% discharges).<br><br>\n    <strong>Backlit control screen<\/strong><br>\n    LCD screen, backlit for better visibility both day and night.\n    Displays: Speed, distance covered and overall, the remaining power and the mode.\n    To access this data, press the Walk\/Stop button.<br>\n    USB port for charging your smartphone.\n    A full suspension frame designed for an easy ride<br>\n    Our engineers designed this hybrid aluminium frame with lower geometry to make it easier to get on the bike. This frame provides greater comfort than ever.\n    The Original 900 E is equipped with a SUNTOUR spring front suspension fork (1 1\/8 pivot in steel) with 63mm travel and rear spring suspension. To adjust the rear suspension, turn the locking ring located directly behind it (this can be done without tools).\n    Derailleurs and drivetrain: enjoy the speed!\n    <br><br><strong>7 speeds which use a quick and easy to use trigger to change between them.<\/strong><br>\n    In detail:<br>\n    - Shimano TZ 500 7-speed freewheel.<br>\n    - Single chainwheel: 38 teeth<br>- Cogs: 14 \/ 28.- Anti-corrosion chain.<br>\n    - Rear derailleur: SRAM X3.- SRAM Trigger x - 3 shifter.<br>\n    - Anti-derailment ring.\n    Hybrid tyres: put rubber to the road<br>\n    The Original 920 E is equipped with B'Twin Trekking hybrid road and trail tyres so you can go anywhere.\n    The recommended pressure is a minimum of 3.0 bar and a maximum of 4.0 bar (details on tyre sidewall).\n    <br><br><string>Dimensions:<\/string><br>\n    - Size S\/M: 26x 1.75.<br>\n    - Size L\/XL: 28 x 1.75.<br>\n    Bonus: Self-healing inner tube.\n    Double-walled wheels\n    Set off on an adventure with the Original 920 E equipped with double-walled aluminium wheels.\n    To transport your bike, the quick-release on the front wheel makes it easy to remove.\n    36-spoke front and rear wheels.\n    <br><br><strong>Wheel diameter:<\/strong><br>\n    - Size S\/M: 26 inches.<br>\n    - Size L\/XL: 28 inches.<br>\n    Brake safely\n    Two V-Brake pads for effective braking.\n    The two steel callipers are equipped with pads that exercise pressure on the rim to slow or stop the rotation of the wheels.\n    Aluminium brake levers.\n    Handlebars, steering, stem: maintain control\n    Semi-raised steel handlebars (620mm).\n    1 aluminium stem 90mm long, adjustable and tiltable.\n    B'Twin ergonomic grips.\n    Saddle be comfortable\n    Because it's important that your seat position is adapted to your riding style, our teams developed the exclusive B'Twin Ergofit gel saddle.\n    Graduated aluminium seat post for easier adjustment.<br>\n    Collar dimensions = 32mm.<br>\n    Seat post diameter = 27.2mm.<br>\n    Tool-free saddle height adjustment (quick-release).\n    Crankset \/ Pedals\n    The Original 920 E is supplied with hybrid one-piece plastic pedals.\n    170mm long aluminium cranks.\n    38-tooth aluminium chainwheel.\n    Plastic chainguard.\n    <br><br><strong>Accessories<\/strong><br>\n    Your Original 920 E is supplied with a bell, lights (front\/rear), wheel reflectors and pedals.\n    Depending on the accessory type and size of the bike, the frame is compatible with:<br>\n    - saddle bag<br>\n    - rear pannier<br>\n    - front pannier<br>\n    This bike isnt compatible with any kind of child seat, whatever the mounting system used\n    For further information, dont hesitate to ask one of our sales assistants.\n    Difference with the Original 900E\n    The 920E has a new set of electrics.\n    The 900 and 920 share the same motor and battery. But despite that, the 920 has a longer battery life.<br>\n    How is this possible? <br>\n    The 900 model tended to give you a lot of energy with each turn of the pedal. This caused jerkiness and wasted energy.\n    The 920 model provides energy more smoothly, so it s more comfortable to ride and doesnt waste so much of the motor s energy.\n    Warranty\n    <br><br><strong>Lifetime guarantee:<\/strong><br> stem and handlebars, Battery and parts: 2 years.\n    <br><br><strong>Weight<\/strong><br>\n    M : 25.5 kg<br>\n    L : 26 kg","productComposition":"n<\/strong><br>\n    Frame 100% Aluminium<br><br>\n    <strong>STORAGE ADVICE<\/strong><br>\n    Store in a dry place.When storing for a prolonged period, put the battery in sleep mode. Do not store the battery discharged (1 green LED flashing).<br><br>\n    <strong>TESTS<\/strong><br>\n    Before reaching stores, our bikes are tested by many hybrid bike enthusiasts. They ride several thousands of kilometres to be properly approved. These tests enable us to guarantee comfort, ease of use and versatility to meet your expectations.<br><br>\n    <strong>User Directions<\/strong><br>\n    Not suitable for mountain bikes and BMX.\n    <br><br><strong>Legal Mentions<\/strong><br>\n    The total weight (bike+cyclist) should not exceed 120kg. Not suitable for children under age 14 years.\n    \n    <br><br><strong>Notice<\/strong><br>\n    To have more informations about this product, consult the notice"},